clases/2021-01-19-complejos-simpliciales.tex
% Created 2021-01-28 Thu 16:48
% Intended LaTeX compiler: pdflatex
\documentclass[spanish, presentation]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{lxfonts}
\usepackage[spanish, mexico, es-noshorthands, english]{babel}
% remove space between margin and lists
\usepackage{enumitem}
\setitemize{label=\usebeamerfont*{itemize item}%
\usebeamercolor[fg]{itemize item}
\usebeamertemplate{itemize item}}
\setlist{leftmargin=*,labelindent=0cm}
\setenumerate[1]{%
label=\protect\usebeamerfont{enumerate item}%
\protect\usebeamercolor[fg]{enumerate item}%
\insertenumlabel.}
\usepackage{listings}
\lstset{
literate={í}{{\'\i}}1
{á}{{\'a}}1
{é}{{\'e}}1
{ó}{{\'o}}1
{ú}{{\'u}}1
}
\lstalias{ipython}{python}
\usepackage{tikz}
\usepackage{tkz-berge}
\usetikzlibrary{graphs}
\usetikzlibrary{graphs.standard}
\usetheme[noframetitlerule]{Verona}
\author{Rafael Villarroel}
\date{2021-01-19 15:40 -0500}
\title{Complejos simpliciales}
\beamerdefaultoverlayspecification{<+->}
\hypersetup{
 pdfauthor={Rafael Villarroel},
 pdftitle={Complejos simpliciales},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.4.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\languagepath{spanish}

\section{Definiciones}
\label{sec:org6337d37}

\begin{frame}[label={sec:org2faa18a}]{Complejo simplicial}
Sea \(X\) un conjunto finito. Un \alert{complejo simplicial} \(\Delta\) en \(X\) es una colección de subconjuntos de \(X\) que es cerrada bajo inclusión. Es decir, si \(\sigma\in\Delta\) y \(\tau\subseteq\sigma\), entonces \(\tau\in\Delta\).
\end{frame}

\begin{frame}[label={sec:orga057b6e}]{Ejemplos}
\begin{enumerate}
\item Sea \(X=\{1,2,3\}\). Sea \(\Delta=\{\emptyset,\{1,2\},\{1\},\{2\}\}\). Entonces \(\Delta\) es un complejo simplicial.
\item Sea \(X=\{1,2,3\}\). Sea \(\Delta=\{\}=\emptyset\). Entonces \(\Delta\) es un complejo simplicial.
\item Sea \(X=\{1,2,3\}\). Sea \(\Delta=\{\emptyset,\{1,2\},\{1\},\{2\},\{3\},\{1,3\}\}\). Entonces \(\Delta\) es un complejo simplicial.
\item Sea \(X\) cualquier conjunto finito. Sea \(\Delta=\mathcal{P}(X)\). Entonces \(\Delta\) es un complejo simplicial.
\item \emph{Observación} Si \(\Delta\) es un complejo simplicial en \(X\), en particular \(\Delta\subseteq \mathcal{P}(X)\).
\item Si \(X=\{1,2,3,4\}\), entonces \(\{\{1,2\},\{1,3\}\}\) no es un complejo simplicial, pues no contiene a \(\{1\}\).
\item Si \(X=\{1,2,3,4\}\), entonces \(\{\emptyset,\{1\},\{1,2\},\{1,2,3\},\{1,2,3,4\}\}\) no es un complejo simplicial, pues no contiene a \(\{2\}\).
\end{enumerate}
\end{frame}

\begin{frame}[label={sec:org8bfa386}]{Más definiciones}
Si \(\Delta\) es un complejo simplicial, sus elementos se llaman \alert{simplejos}. Si \(\tau\subseteq\sigma\), decimos que \(\tau\) es una \alert{cara} de \(\sigma\). La \alert{dimensión} \(\dim\sigma\) de un simplejo \(\sigma\) es \(\dim\sigma=|\sigma|-1\). La dimensión de \(\Delta\) es \(\dim\Delta=\max\{\dim\sigma\mid \sigma\in\Delta\}\). 
\end{frame}

\begin{frame}[label={sec:org71b5183}]{Subcomplejo}
Sean \(\Delta_{1}\) y \(\Delta_{2}\) dos complejos simpliciales en \(X\). Decimos que \(\Delta_{1}\) es \alert{subcomplejo}
 de \(\Delta_{2}\) si \(\Delta_{1}\subseteq \Delta_{2}\). Por ejemplo, si , \(\Delta_{2}=\{\emptyset,\{1,2\},\{1\},\{2\},\{3\},\{1,3\}\}\), el complejo simplicial \(\Delta_{1}=\{\emptyset,\{1\},\{2\},\{3\}\}\) es subcomplejo de \(\Delta_{2}\).
\end{frame}

\begin{frame}[label={sec:orga5a9f84}]{Esqueleto}
Si \(\Delta\) es cualquier complejo simplicial y \(k\) es un número natural, definimos el \alert{\(k\)-esqueleto}
 como \(\Delta^{(k)}=\{\sigma\in\Delta\mid \dim\sigma\leq k\}\). Por ejemplo, si \(X=\{1,2,3,4\}\) y  \(\Delta=\{\emptyset,\{1,2\},\{1\},\{2\},\{3\},\{1,3\}\}\), tenemos que:
\begin{itemize}
\item \(\Delta^{(0)}=\{\emptyset,\{1\},\{2\},\{3\}\}\),
\item \(\Delta^{(1)}=\Delta\).
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgb7b1b2a}]{Otro ejemplo de esqueleto}
Como otro ejemplo, sea \(X=\{1,2,3,4\}\), sea \(\Delta=\mathcal{P}(X)\). Entonces:
\begin{itemize}
\item \(\Delta^{(0)}=\{\emptyset, 1,2,3,4\}\). (En adelante, haremos la convención de denotar, por ejemplo, a \(\{1\}\) como \(1\) y a \(\{1,2\}\) como \(12\))
\item \(\Delta^{(1)}=\Delta^{(0)}\cup\{12,13,14,23,24,34\}\).
\item \(\Delta^{(2)}=\Delta^{(1)}\cup\{123,134,234,124\}\).
\item \(\Delta^{(3)}=\Delta=\Delta^{(4)}\).
\end{itemize}

\alert{Tarea}   Demuestra que para toda \(k\), el \(k\)-esqueleto de \(\Delta\) es un subcomplejo de \(\Delta\).
\end{frame}

\begin{frame}[label={sec:orgf52c318}]{Caras maximales}
Sea \(\Delta\) un complejo simplicial. Un simplejo \(\sigma\in \Delta\) es una \alert{cara maximal}, si \(\sigma\subseteq\tau\) para \(\tau\in\Delta\) implica que \(\sigma=\tau\).
Por ejemplo, si \(X=\{1,2,3\}\), y \(\Delta=\{\emptyset,\{1,2\},\{1\},\{2\},\{3\},\{1,3\}\}\). Entonces las caras maximales \(\Delta\) de son \(\{1,2\}\) y \(\{1,3\}\). Las caras maximales también se suelen llamar \alert{facetas}. Denotaremos a la colección de facetas del complejo simplicial \(\Delta\) como \(\mathcal{F}(\Delta)\).

\emph{Observación:}
Un complejo simplicial está determinado por sus caras maximales. Por ejemplo, sea \(\Delta\) el complejo simplicial con conjunto de caras maximales dado por \(\{123,124,134,234\}\). Entonces \(\Delta\) es esencialmente un tetraedro hueco.
\end{frame}
\end{document}